---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupCannotMixBackAndForegroundDetail
source: html/451721ab-08e4-228e-0c06-fef270288fdf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupCannotMixBackAndForegroundDetail Property

This detail group contains some elements which display in the background and some which display in the foreground. Detail groups
 must be able to be displayed as a unit in either the foreground or background, so this type of mixture is not allowed.

## Syntax (C#)
```csharp
public static FailureDefinitionId GroupCannotMixBackAndForegroundDetail { get; }
```